[
   {
      "name": "Locapic",
      "lang": "fr",
      "img": "/img/projects/locapic.webp",
      "description": "Locapic - Points d'interet et chat avec les autres utilisateurs.\n Application en React Native de localisation en temps réel, avec possibilité de sauvegarder des points d'interêt sur la carte (sauvegardés dans le téléphone dans le local storage). Chat en temps réel avec les autres utilisateurs connectés.\n Backend: express, socket.io. Frontend: Redux, React native, Async Storage, react-native-elements, socket.io client.\n Pour démarrer: - Changer l'adresse ip de 'localhost' à l'adresse ip interne du backend dans le fichier ChatScreen.js du frontend/screens. - Faire npm install et npm start dans les dossiers frontend et backend. - Pour tester l'app depuis un téléphone, scanner le qr code du terminal avec l'application Expo.\n Socket.io is very unstable, so maybe using ws module will fix this.",
      "stack": [
         "React Native (Expo)",
         "Socket.io",
         "REST Api express"
      ]
   },
   {
      "name": "Bikeshop",
      "lang": "en",
      "img": "/img/projects/bikeshop.webp",
      "description": "Bike shop with cart and checkout project for testing purposes\n Using payment system api: Stripe.\n To start project: - put your stripe api key in routes/index.js file - do npm install - do npm start\n Shopping cart editing Mostly back-end project on NodeJS with express-generator with EJS",
      "stack": [
         "Express EJS",
         "Dynamic Views",
         "Webservice API (Stripe)",
         "Bootstrap"
      ],
      "codeLink":"https://github.com/kris1803/portfolio/tree/main/bikeshop"
   },
   {
      "name": "myMoviz",
      "lang": "fr",
      "img": "/img/projects/mymoviz.webp",
      "description": "Application en MERN stack, pour voir les films actuels au cinéma et pourvoir les ajouter à la wishlist de son compte personnel. Frontend situé dans le répertoire reactapp.\n Affichage des derniers films sortis en cinéma.\n Possibilité d'ajout de films en wishlist, et possibilité de noter les films. Utilisation de l'api the movie DB.\n ! Pensez à mettre votre clé d'api dans le fichiers routes/index.js. ! Pensez à mettre un lien de connexion mongodb dans models/bdd.js\n Démarrer le backend en premier, puis le frontend situé dans reactapp/ dans un autre terminal.\n Pensez à faire npm install et npm start dans le frontend et le backend.",
      "stack": [
         "React",
         "theMDB API",
         "Express mongoDB"
      ]
   },
   {
      "name": "morningNews",
      "lang": "fr",
      "img": "/img/projects/morningnews.webp",
      "description": "MERN stack web application, for your news digests for each day. You can add articles to wishlist, and open them later. Authorization with signin/signup. Passwords are in plain text, because it's only for testing. Bcrypt is easy to implement.\n The React frontend is in reactapp/ . (not production build).\n Before starting:\n   - Put your newsapi api key in reactapp/src/ScreenSource.js , reactapp/src/ScreenArticlesBySource.js\n   - Put your mongodb connection link in models/bdd.js\n   - Do npm 'install' and 'npm start'",
      "stack": [
         "React",
         "Redux",
         "REST api",
         "Express",
         "MongoDB"
      ],
      "codeLink":""
   },
   {
      "name": "weatherApp",
      "lang": "en",
      "img": "/img/projects/weatherapp.webp",
      "description": "WeatherApp in MEN stack.\n Authorization : Signup, Signin. Saved in mongoDb.\n Application to see minimal and maximum temperature by city, and weather description.\n Adding/Removing cities to favorites. Markers on map where are selected cities. Cities are saved to mongoDb, so they are persistent. Refresh button to refresh data for cities. Weather route is protected. Using Bootstrap 5.\n To start: - put your OpenWeatherMap api key in routes/index.js - put your connection link to mongodb in ./models/connection.js file. - npm install - npm start",
      "stack": [
         "Bootstrap 5",
         "OpenWeatherMap API"
      ],
      "codeLink": "https://github.com/kris1803/portfolio/tree/main/weatherapp"
   }
]